{"pages":[],"posts":[{"title":"Greetings, programs!","text":"My name is Brendan Baldwin. I?ve been a professional software developer for around 25 years. Currently, I work on writing developer tools for the Polymer Project. This site is my place to think out loud about topics related to the technologies, philosophies, and practices in the field of computer science and human-computer interaction. I learned BASIC programming on a TRS-80 Model III in 1982, when I was in 2nd grade. Since then I have been passionate about software?s potential for enhancing our human capabilities to learn and comprehend, to imagine and create, and to connect and communicate. As the pace of change in the world accelerates, these tools are increasingly crucial to our effectiveness and perhaps our survival. However, I feel like there?s got to be a better way to write software. In the past I tried to solve for my dissatisfaction by learning new programming languages, thinking I?d find my silver bullet in the next and greatest. While I?ve been thrilled and edified by the experience of mastering them, I come back to the same feeling that something is missing time and again. I?ve even considered trying to create an ideal programming language to solve for this feeling. What I realized, though, is that this is probably not the solution to making me a happy developer. Of course, I might still do it, but first I have some large questions to answer. My current focus then has turned to exploring the landscape outside mainstream practices for an approach worthy of the future of my career. This blog will serve as the lab notebook and soapbox for that effort. I am very much interested in feedback for the ideas presented and I hope to make some new friends along the way. I can also be stalked online at these fine websites: Facebook where I try not to be petty, but mostly push my politics and family photos onto my friends feeds. Github where I send away all of the code I write so I can have some personal space. LinkedIn where I rationalize the trajectory of my haphazard meanderings into the semblance of a deliberate career. Soundcloud where I post original music I&#39;ve written and recorded and pretend its actually good enough for people other than myself to listen to. Twitter where I share secrets of the universe which fractally replicate and take over the minds of everyone who comprehends them. YouTube where I upload totes rando videos.","link":"/2018/12/07/greetings-programs/"}],"tags":[],"categories":[]}