[{"reviews_with_mentions": "<ul><li> <font color=#60B2D0> We love it here - a great <b>business lunch</b>, and terrific happy hour too.</font>  </li><li> <font color=#60B2D0> I had a <b>business lunch</b> meeting at Chaya and everything went perfectly.</font> Our waiter was quick and responsive. Our delicious food came out in a timely manner and everyone was friendly. </li><li> <font color=#60B2D0> The Chaya downtown location is always a great spot for a <b>business lunch</b> meeting, with nice ambiance, great service and convenient parking.</font> The bento boxes are always a good mix of a bit of everything and everything is always tasty and consistent. Fresh and satisfying. </li><li> Having dined her for lunch on several occasions, dinner once and happy hour many times, I find the service to be extremely reliable. <font color=#60B2D0> The <b>business lunch</b> offers excellent up-to-date choices for a good value.</font>  </li><li> <font color=#60B2D0> Had a wonderful <b>business lunch</b> at Chaya DTLA</font>  </li><li> This was an amazing experience! The food was great, the server, Emilia, was so pleasant and efficient. We were going to a show and she asked what time we needed to be out of there. They made my husband feel very special since it was his birthday. The menu was very eclectic and delicious. I had been to Chaya Brasserie and this restaurant out did it! <font color=#60B2D0> This could also be appropriate for a <b>business lunch</b> or dinner.</font>  </li><li> Food is always good and the service is always great. <font color=#60B2D0> A good place for a <b>business lunch</b>.</font>  </li></ul>", "best_snippet": "... We love it here - a great <font color=#DA3743>business lunch</font>, and terrific happy hour too. ...", "candidate_snippets": "<ul><li> We love it here - a great business lunch, and terrific happy hour too. <font color=#60B2D0> (senitment: 0.99) </font> </li><li> I had a business lunch meeting at Chaya and everything went perfectly. <font color=#60B2D0> (senitment: 0.97) </font> </li><li> The Chaya downtown location is always a great spot for a business lunch meeting, with nice ambiance, great service and convenient parking. <font color=#60B2D0> (senitment: 0.97) </font> </li><li> The business lunch offers excellent up-to-date choices for a good value. <font color=#60B2D0> (senitment: 0.95) </font> </li><li> Had a wonderful business lunch at Chaya DTLA <font color=#60B2D0> (senitment: 0.92) </font> </li><li> This could also be appropriate for a business lunch or dinner. <font color=#60B2D0> (senitment: 0.80) </font> </li><li> A good place for a business lunch. <font color=#60B2D0> (senitment: 0.53) </font> </li>", "dish_name": "Good for a Business Meeting"}]