[{"reviews_with_mentions": "<ul><li> Highly recommend Kokkari Estiatorio.  My preference is to still in the room in the front as you have the rotisserie over the open fire to gaze at.  I had the rotisserie of the day (lamb of course) and my bf had the moussaka.  <font color=#60B2D0> We started our meal with the delicious <b>zucchini cakes</b> and the smelt.</font>  Both were excellent with superb dipping sauces.  The service was excellent.  You will not be disappointed. </li><li> Pretty much everything we had was amazing. <font color=#60B2D0> The <b>zucchini cakes</b> were the best.</font> The flatbread we had was mediocre and the grilled branzini was super flavorful - the de-boned it and everything! Was a nice light dish. We also had a salad which our waiter recommended that was a great combo of flavors with blue cheese dressing. I have to commend our waiter for helping us out with his recommendations. I've heard all their desserts are amazing but the fried filo dough with custard dish was to die for! It really made my husband's birthday dinner extraordinary.  The only thing I regret is not getting the lamb chops since everyone raves about them. But alas, my husband is not keen on eating baby animals. </li><li> I'm glad I made a reservation beforehand because the place was quite crowded when we went there for lunch on Friday. There were a number of people waiting by the door for a table. Our server was genuinely friendly and attentive. <font color=#60B2D0> We ordered the <b>zucchini cakes</b>, grilled lamb chops, and baklava, all of which were superb.</font> The grilled lamb chops were flavorful, tender, and juicy. On another note, while the baklava was good, it would have been too sweet had there not been the vanilla-praline ice cream on the side. All in all, I will definitely come back here again to try the saghanaki, salmon, and souvlaki. </li><li> It had been some time since I last had lunch at Kokkari.  It's just as good as it always was.  The service is polished, and seems to be really dialed in.  And the food remains excellent.  <font color=#60B2D0> Started with the spreads and <b>zucchini cakes</b>, and then had the lamb schwarma, which was right off the grill and cooked a perfect medium (just as I had asked for it).</font>  I'll keep coming back. </li><li> We went internet surfing for some different restaurants for our stay in San Francisco and Kokkari came up on our search for Greek restaurants.  We didn't read any reviews and took a chance, because the website looked fab.  We were so not disappointed.  The service and food were fantastic and it was our best meal in San Francisco without a doubt.  <font color=#60B2D0> The <b>zucchini cakes</b> were so good we had a second serving!!!!</font>  </li><li> Excellent, food, service and very friendly staff. The roasted lamb over the fire is wonderful, full of flavor, moist and tender. <font color=#60B2D0> The <b>zucchini cakes</b> are fresh, crisp and a must to try.</font> The house wine Cab Sav was smooth and perfect with my lamb shank. Highly recommend eating here, don't rush your evening, savor the food. You must book! </li><li> The food was outstanding. I had an artichoke and eggplant souvlaki. The plate was beautiful and artfully arranged. <font color=#60B2D0> I also had a small <b>zucchini cake</b> appetizer that was just as good.</font> The ambiance was excellent. What a beautiful place. I went for lunch and it was packed with financial types - men in suits and ties and women in heels. I wasn't in either but felt dressed OK (not in jeans and t-shirt, though). Service was superb. I will return. </li><li> Our meal was excellent.  I brought our out-of-town guests, and they were beyond impressed with the meal, the ambiance, and the service.  We ordered a variety of appetizers, and a greek salad and moussaka to share.  <font color=#60B2D0> The octopus and <b>zucchini cakes</b> were standouts.</font>  We were accidentally served the grilled dish of the day, and when we told them that we didn't order it, they told us to keep it and enjoy it anyway.  It turned out to be the best grilled lamb we've ever tasted, and I will certainly go back and make sure to order it next time.  This might be my new favorite restaurant in SF. </li><li> Took our friends from Washington DC out to dinner.  Impeccable service, the waiter was attentive, informative, and genuinely interested in making our experience marvelous.  Then the food--shared appetizers were great--the watermelon and feta was our favorite at the table.   Peaches with figs were stupendous.  <font color=#60B2D0>  <b>Zucchini cakes</b> with cucumber mint yogurt dressing too.</font>   For my entree I had the duck--roasted in the open fireplace.  I was so into the duck I paid no attention to my wife or friend's main dishes.  Everyone was so happy at the end of the meal that we went out to a nightclub after to keep the evening going. </li><li> I have been wanting to go to Kokkari for several years.  We live in the East Bay, and it is not super convenient.   However, when my husband asked me where I wanted to eat for my birthday, the restaurant came immediately to mind.   It was a lovely finale to a great day in the city.   We were greeted warmly by the receptionist, who immediately wished me a happy birthday.  We were quickly seated in the front room.  Our head waiter, Max, was engaging and his suggestions did not disappoint.  Wait staff was attentive without being intrusive.    We decided to order only appetizers (about 9).  <font color=#60B2D0> Favorites were the <b>zucchini cakes</b>, grilled artichoke and eggplant, grilled calamari, and grilled octopus.</font>   Yogurt dessert and Greek coffee yummy too! </li><li> We had been looking forward to trying Kokkari for some time and in most ways it lived up to expectation.  Great food and environment.  Can share a variety of small plates or opt for a full meal.  <font color=#60B2D0> I would recommend the <b>zucchini cakes</b> to start and any of their lamb or rotisserie specials as an entree.</font>  </li><li> <font color=#60B2D0> We shared three small plates including the <b>zucchini cakes</b> and an artichoke skewer, then shared the branzino (sea bass) for the main course.</font>  All dishes were fresh, tasty, and superbly prepared.  This place has it all! </li><li> Our best restaurant experience in San Fran. <font color=#60B2D0> Spiced lamb meat balls, <b>zucchini cakes</b>, braised lamb casserole, roasted lemon chicken.</font> Excellent! </li><li> As a Greek American, I would rate the good here as very good. <font color=#60B2D0> The gigantes are world class, as well as the <b>zucchini cakes</b> and chicken livers.</font> The Kotopoulo is excellent, and the Greek oven roasted potatoes are perfectly done and so good. This restaurant is a little pricey, but the quality is first rate and portions large enough to take home leftovers. Yum! Wish there were more of these restaurants!! </li></ul>", "best_snippet": "... We started our meal with the delicious <font color=#DA3743>zucchini cakes</font> and the smelt.  Both were excellent with superb dipping sauces.  The service was excellent.  You ...", "candidate_snippets": "<ul><li> We started our meal with the delicious zucchini cakes and the smelt. <font color=#60B2D0> (senitment: 1.00, other tags: 0) </font> </li><li> The zucchini cakes were the best. <font color=#60B2D0> (senitment: 1.00, other tags: 0) </font> </li><li> We ordered the zucchini cakes, grilled lamb chops, and baklava, all of which were superb. <font color=#60B2D0> (senitment: 1.00, other tags: 0) </font> </li><li> Started with the spreads and zucchini cakes, and then had the lamb schwarma, which was right off the grill and cooked a perfect medium (just as I had asked for it). <font color=#60B2D0> (senitment: 0.64, other tags: 0) </font> </li><li> The zucchini cakes were so good we had a second serving!!!! <font color=#60B2D0> (senitment: 0.35, other tags: 0) </font> </li><li> The zucchini cakes are fresh, crisp and a must to try. <font color=#60B2D0> (senitment: 0.28, other tags: 0) </font> </li><li> I also had a small zucchini cake appetizer that was just as good. <font color=#60B2D0> (senitment: 0.22, other tags: 0) </font> </li><li> The octopus and zucchini cakes were standouts. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> Zucchini cakes with cucumber mint yogurt dressing too. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> Favorites were the zucchini cakes, grilled artichoke and eggplant, grilled calamari, and grilled octopus. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> I would recommend the zucchini cakes to start and any of their lamb or rotisserie specials as an entree. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> We shared three small plates including the zucchini cakes and an artichoke skewer, then shared the branzino (sea bass) for the main course. <font color=#60B2D0> (senitment: -0.08, other tags: 0) </font> </li><li> Spiced lamb meat balls, zucchini cakes, braised lamb casserole, roasted lemon chicken. <font color=#60B2D0> (senitment: -0.60, other tags: 1) </font> </li><li> The gigantes are world class, as well as the zucchini cakes and chicken livers. <font color=#60B2D0> (senitment: -0.60, other tags: 0) </font> </li>", "dish_name": "Zucchini Pancakes"}, {"reviews_with_mentions": "<ul><li> <font color=#60B2D0> Superb Greek food, particularly the lamb, <b>whole fish</b>, and starter courses.</font> Superb desserts. Very friendly and attentive service. Even the valet service out front works well. A seamless and completely satisfying dining experience. </li><li> This is the second time I have been at Kokkari, and both occasions were to celebrate something special. The restaurant has become a favorite for us at home, regardless if it is for a romantic meal or to have a special meal including our kids. The excellence of Kokkari is based on consistency, warm service, extraordinary quality of ingredients and superb cuisine that took us back to Europe (I am from Spain and felt right at home). The menu changes slightly depending on the day. <font color=#60B2D0> Highest recommendation is for the <b>whole fish</b> (there are always a few choices based on the market that day) grilled to absolute perfection, de-boned and presented beautifully.</font>  Hands down, one of our favorite places in San Francisco, and a special place for our family. </li><li> Their burger is one of the best on the planet. It's unique, a little different because it's lamb, but truly outstanding. <font color=#60B2D0> If it's your first time, order the riblets, the cheese, and the <b>whole fish</b>.</font> On your next visit get the octopus salad. </li><li> My boyfriend ate here last Sunday, after he ran the SF marathon. We simply loved the restaurant. It is beautiful, the service was simply amazing. Our waiter Jeff, was perfect. All the staff we came into contact with were top notch. Food -- unbelievable!!! <font color=#60B2D0> We tried the prawns, the duck stuffed grape leaves, the roasted eggplant, the goat stew and the grilled <b>whole fish</b>.</font> Scrumptious, all. The only down side is that we were so full, we didn't leave room for dessert. Next time... </li><li> The service was perfect! and Jeff, our waiter, knew the perfect wine pairing with each course. The food was extremely well prepared and presented. We were very happy with the whole experience including appetizers, main courses and dessert (not to be missed). Since it is a Greek restaurant we chose what we thought would be most authentic: grilled octopus, asparagus with crumbled myzithra and herbs and lamb meatballs. All were delicious. I would not get the grilled octopus again, but it was nice to experience. Entrees were outstanding! <font color=#60B2D0>  <b>Whole fish</b> off of the grill(they even deboned it) and the lamb shank tender and flavorful.</font> Desserts were also fabulous with the Greek \"donuts\" and homemade baklava plus ouzo and more wine.  We LOVED it! </li><li> <font color=#60B2D0> The <b>whole fish</b> was very tasty.</font> It i a bit overpriced. </li><li> Superb Greek food that never misses a beat. Every dish and every course is just about perfect. Great variety to choose from. <font color=#60B2D0> The <b>whole fish</b> and lamb chops are especially recommended.</font> Leave room for dessert. Take lots of people so you can try everything on the menu. Just about the best in S.F. at the moment. Bravo! </li><li> Nothing you consume here can be wrong. <font color=#60B2D0> The <b>whole fish</b> that he ordered me was traditionally grilled with all the essential Mediterranean spices.</font> The goat stew was neither gamey nor tough but melts in my mouth with the tantalizing release of all the fragrant exotic herbs.  Desert was a masterpiece that I could not possible pronounce but it was a modest custard filled filo with an adornment of pistachio ice cream that I would only hope to perfect if I ever decide to bake at one point in my life. Oh, bypass the Greek coffee and opt for an ouzo if you don't want to lay awake at 3am wondering when you'll ever be able to head back to the island of Kokkari Estiatorio.  N?stima was the word uttered over and over again and again.. </li><li> we had an outstanding waiter,  friendly , knowledgeable, professional and courteous. Food was very well prepared and presented. <font color=#60B2D0> We had 4 small plates, soup, salad and a <b>whole fish</b> as our main dish.</font> We enjoyed each plate to the fullest. We had a Spanish wine which was also very outstanding. Wine list is a bit high, dinner well worth it. </li><li> Packed and noisey but fun atmosphere. Warm decor. Waiters very busy but friendly. Chicken livers and Brussels sprouts awesome. Lamb chops fantastic. <font color=#60B2D0> My husband had <b>whole fish</b> which was mediocre.</font> Expensive but good. </li></ul>", "best_snippet": "... Superb Greek food, particularly the lamb, <font color=#DA3743>whole fish</font>, and starter courses. Superb desserts. Very friendly and attentive service. Even the valet servic ...", "candidate_snippets": "<ul><li> Superb Greek food, particularly the lamb, whole fish, and starter courses. <font color=#60B2D0> (senitment: 0.34, other tags: 0) </font> </li><li> Highest recommendation is for the whole fish (there are always a few choices based on the market that day) grilled to absolute perfection, de-boned and presented beautifully. <font color=#60B2D0> (senitment: 0.26, other tags: 0) </font> </li><li> If it's your first time, order the riblets, the cheese, and the whole fish. <font color=#60B2D0> (senitment: 0.23, other tags: 0) </font> </li><li> We tried the prawns, the duck stuffed grape leaves, the roasted eggplant, the goat stew and the grilled whole fish. <font color=#60B2D0> (senitment: 0.20, other tags: 1) </font> </li><li> Whole fish off of the grill(they even deboned it) and the lamb shank tender and flavorful. <font color=#60B2D0> (senitment: 0.20, other tags: 1) </font> </li><li> The whole fish was very tasty. <font color=#60B2D0> (senitment: 0.20, other tags: 0) </font> </li><li> The whole fish and lamb chops are especially recommended. <font color=#60B2D0> (senitment: 0.10, other tags: 0) </font> </li><li> The whole fish that he ordered me was traditionally grilled with all the essential Mediterranean spices. <font color=#60B2D0> (senitment: 0.07, other tags: 0) </font> </li><li> We had 4 small plates, soup, salad and a whole fish as our main dish. <font color=#60B2D0> (senitment: 0.04, other tags: 0) </font> </li><li> My husband had whole fish which was mediocre. <font color=#60B2D0> (senitment: -0.15, other tags: 0) </font> </li>", "dish_name": "Whole Fish"}, {"reviews_with_mentions": "<ul><li> Wow. This place was great. Definitely get the octopus app. My wife and I don't generally eat Octopus, but wife and I both loved this dish. <font color=#60B2D0>  <b>Greek salad</b> was fresh and delicious.</font> Both main dishes, Daily roast and daily fish, were spectacular. If the meal wasn't perfect enough, the dessert made it better. I forget the name, but it was these little Greek pastried covered in honey. Worth going to this place just for Dessert (or just for the bar that seemed packed) </li><li> Excellent dinner and evening!  windows open, gentle breeze and fantastic meal!  <font color=#60B2D0> Fresh pea appetizer, <b>greek salad</b>- crisp and bright, sea bass grilled to perfection, and believe it or not, meatball appetizer for dessert...took cookies home and had them with my morning coffee.</font>  All staff from the front door to all aspects  of my meal were attentive but not intrusive.  Waiters recommendations were spot on.  Would eat here often if I lived in San Francisco. </li><li> My two friends and I had lunch together at Kokkari on Monday, Jan 27, as a special way to ring in the New Year. None of us had been there for lunch, though two of us have had amazing dinners at Kokkari. The lunch menu did not disappoint! The service was excellent - thank you to Collette - and our meal was top notch. <font color=#60B2D0> We had the whole sole and whole sea bass, plus a <b>Greek salad</b> with sides of greens and butternut squash.</font> This after a very tasty appetizer of dips, bread and octopus. Thank you for helping us start 2014 in a beautiful way! </li><li> Our meal was excellent.  I brought our out-of-town guests, and they were beyond impressed with the meal, the ambiance, and the service.  <font color=#60B2D0> We ordered a variety of appetizers, and a <b>greek salad</b> and moussaka to share.</font>  The octopus and zucchini cakes were standouts.  We were accidentally served the grilled dish of the day, and when we told them that we didn't order it, they told us to keep it and enjoy it anyway.  It turned out to be the best grilled lamb we've ever tasted, and I will certainly go back and make sure to order it next time.  This might be my new favorite restaurant in SF. </li><li> The food is not your typical Greek food. Lots of great choices which made it difficult to decide what to order. <font color=#60B2D0> We split a <b>Greek salad</b> and stuffed calamari starter.</font> We also shared a delicious fish special. We ended with dessert and Greek coffee. After dinner a manager(?) came by to see see if we enjoyed our meal, I asked him about the huger copper pot that was in the coffee making station. He took me over and demonstrated how the Greek coffee is made. Ver interesting and I really enjoyed the demo. Our waitperson also made our meal even more enjoyable. He explained the various entres, made great suggestions, and checked on us frequently. We will definitely return here the next time we are in SF. </li></ul>", "best_snippet": "... <font color=#DA3743>Greek salad</font> was fresh and delicious. Both main dishes, Daily roast and daily fish, were spectacular. If the meal wasn't perfect enough, the dessert ma ...", "candidate_snippets": "<ul><li> Greek salad was fresh and delicious. <font color=#60B2D0> (senitment: 0.43, other tags: 0) </font> </li><li> Fresh pea appetizer, greek salad- crisp and bright, sea bass grilled to perfection, and believe it or not, meatball appetizer for dessert...took cookies home and had them with my morning coffee. <font color=#60B2D0> (senitment: 0.22, other tags: 0) </font> </li><li> We had the whole sole and whole sea bass, plus a Greek salad with sides of greens and butternut squash. <font color=#60B2D0> (senitment: 0.05, other tags: 0) </font> </li><li> We ordered a variety of appetizers, and a greek salad and moussaka to share. <font color=#60B2D0> (senitment: 0.00, other tags: 1) </font> </li><li> We split a Greek salad and stuffed calamari starter. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li>", "dish_name": "Traditional Greek Salad"}, {"reviews_with_mentions": "<ul><li> This was recommended to us by a friend who had lived in San Francisco. We weren't disappointed. The food was amazing. <font color=#60B2D0> It was the best <b>moussaka</b> that I've ever had.</font> The wine list was great. We loved everything that we ordered. </li><li> We went to celebrate our anniversary and our friend's birthday.  Made reservations and were immediately seated.  We had a WONDERFUL and energetic waiter, Michael. <font color=#60B2D0> Most of the dishes we felt were delicious: lamb shank, <b>moussaka</b>, octopus, calamari.</font>  We were disappointed with the rotisserie of the evening which was lamb, felt it very bland in taste. Delicious dessert we shared (so full, took food home)-nicely presented for the celebrations but I did feel they should have comped the dessert--good will!! All in all a memorable place to celebrate. </li><li> Try the pikti!  It is pig head and feet, course chopped and smooshed together in a patty with chopped egg and pickle on top.  Delicious!  Eat it by itself or on top of the delicious homemade bread.  Flourless chocolate cake was the bomb-diggity, as the kids say.  Fig, arugula and feta salad was interesting salad but the feta should be crumbled, not in a slice on the plate.  <font color=#60B2D0>  <b>Moussaka</b> was really good.</font>  </li><li> Had to wait 3 days for availability, but well worth the wait! The food was amazing! <font color=#60B2D0> The giant beans was a great starter choice and the <b>moussaka</b> was the best I've ever had.</font> Great place. </li><li> We went to kokkari restaurant last weekend and we had a fabulous experience. The location is great as there is a lot of street parking in the area and the restaurant is situated right at a corner. As soon as you enter, you know that it will be a nice place. They seated us to our table and with the ambiance it is so romantic! We had the kalamari and dolmathes for appetizers. <font color=#60B2D0> Next, for the entree I had the lamb chops which were mouth-watering and my boyfriend had the <b>Moussaka</b>.</font> I wouldn't recommend the Moussaka unless you like really creamy food! You would need to pair it with something else. Lastly, we had ouzo sorbet for dessert. Delicious! Would totally recommend this restaurant. </li><li> A friend and I recently celebrated my birthday with lunch at Kokkari's which has been a favorite for mine since it opened. We requested a window table in the front/bar area because there is nice space between tables and allowed us to be comfortable for a long visit. Our server, MIchael, was exceptional! He was very helpful, attentive and most gracious to us. <font color=#60B2D0> I had the Lamb Souvlaki --the lamb was very tender, beautifully seasoned and my friend the <b>Moussaka</b>, also very tastey.</font> We finished with 2 desserts: for chocolate lovers, the Sololatina and then the Kataifi Ekmek. I couldn't have asked for a better celebration than this. </li><li> Highly recommend Kokkari Estiatorio.  My preference is to still in the room in the front as you have the rotisserie over the open fire to gaze at.  <font color=#60B2D0> I had the rotisserie of the day (lamb of course) and my bf had the <b>moussaka</b>.</font>  We started our meal with the delicious zucchini cakes and the smelt.  Both were excellent with superb dipping sauces.  The service was excellent.  You will not be disappointed. </li><li> Our meal was excellent.  I brought our out-of-town guests, and they were beyond impressed with the meal, the ambiance, and the service.  <font color=#60B2D0> We ordered a variety of appetizers, and a greek salad and <b>moussaka</b> to share.</font>  The octopus and zucchini cakes were standouts.  We were accidentally served the grilled dish of the day, and when we told them that we didn't order it, they told us to keep it and enjoy it anyway.  It turned out to be the best grilled lamb we've ever tasted, and I will certainly go back and make sure to order it next time.  This might be my new favorite restaurant in SF. </li></ul>", "best_snippet": "... It was the best <font color=#DA3743>moussaka</font> that I've ever had. The wine list was great. We loved everything that we ordered. ...", "candidate_snippets": "<ul><li> It was the best moussaka that I've ever had. <font color=#60B2D0> (senitment: 1.00, other tags: 0) </font> </li><li> Most of the dishes we felt were delicious: lamb shank, moussaka, octopus, calamari. <font color=#60B2D0> (senitment: 0.75, other tags: 1) </font> </li><li> Moussaka was really good. <font color=#60B2D0> (senitment: 0.70, other tags: 0) </font> </li><li> The giant beans was a great starter choice and the moussaka was the best I've ever had. <font color=#60B2D0> (senitment: 0.60, other tags: 0) </font> </li><li> Next, for the entree I had the lamb chops which were mouth-watering and my boyfriend had the Moussaka. <font color=#60B2D0> (senitment: 0.35, other tags: 0) </font> </li><li> I had the Lamb Souvlaki --the lamb was very tender, beautifully seasoned and my friend the Moussaka, also very tastey. <font color=#60B2D0> (senitment: 0.22, other tags: 1) </font> </li><li> I had the rotisserie of the day (lamb of course) and my bf had the moussaka. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> We ordered a variety of appetizers, and a greek salad and moussaka to share. <font color=#60B2D0> (senitment: 0.00, other tags: 1) </font> </li>", "dish_name": "Moussaka"}, {"reviews_with_mentions": "<ul><li> We had the best meal of our US trip here. Hostesses were so welcoming and the decor and ambiance is beautiful and vibrant. Our waiter was professional and passionate and sold us on some wonderful specials. <font color=#60B2D0> The <b>lamb souvlaki</b> and lamb chops best we have ever had and we are from NZ!</font> tried to return to try the chicken but was booked out, you must book early. </li><li> I hadn't been to Kokkari in several years, and recently went there with two other people.  I remember Kokkari being a very good restaurant, but now I'd have to put it at the top of my list.  It's great to see a restaurant last, and no small feat for restauranteurs in SF.  Kokkari has a wonderful patina, and the decor and staff exude confidence in knowing that your experience will be memorable.  The peach and fig salad was a great start to this excellent meal. A fellow diner had the watermelon salad which looked equally delicious.  <font color=#60B2D0> For my entree, I had the <b>lamb souvlaki</b> and enjoyed every bite.</font>  The service was attentive, patient, and thoughtful. A shear delight, make sure Kokkari is on your list! </li><li> Kokkari's has the most amazing fresh Greek food! Loved everything, and the service was great. We went on President's day for lunch, so no problem getting a reservation. If you plan to go on a non-holiday, book in advance as they get booked fast. Go with a bunch of friends and share a little of everything. Calamari was super fresh. Whole sea bass was cooked perfectly. <font color=#60B2D0>  <b>Lamb Souvlaki</b> was great and the tzatziki sauce was super fresh and tasty.</font> Baklava Ice Cream was fantastic! I love Kokkari's and will definitely be back...if I can get a reservation! </li><li> A friend and I recently celebrated my birthday with lunch at Kokkari's which has been a favorite for mine since it opened. We requested a window table in the front/bar area because there is nice space between tables and allowed us to be comfortable for a long visit. Our server, MIchael, was exceptional! He was very helpful, attentive and most gracious to us. <font color=#60B2D0> I had the <b>Lamb Souvlaki</b> --the lamb was very tender, beautifully seasoned and my friend the Moussaka, also very tastey.</font> We finished with 2 desserts: for chocolate lovers, the Sololatina and then the Kataifi Ekmek. I couldn't have asked for a better celebration than this. </li><li> <font color=#60B2D0> The food was fantastic: we had the chicken and the <b>lamb souvlaki</b>.</font>  They were done perfectly.  We had the seasonal special dessert of berries/cake.  It tasted like summer - fresh, ripe, sweet.  Our server, Kathleen, was helpful and friendly. </li><li> We expected a lot of Kokkari, being at the top of at least one SF restaurant list. The service was indeed excellent, and an impressive wine list they have. But, in our modest opinion, the food was only between ok and good. The tzatziki should have tasted more of mint and less of dill and the (c)horiatiki was a bit disappointing as well. <font color=#60B2D0> The <b>lamb souvlaki</b> was well cooked and tasty, but the meat was suboptimal, with tendons and other stuff the knife could not deal with.</font> A couple of days later, we had virtually the same food at Taverna Tony in Malibu and that was clearly better, on all counts: tzatziki, horiatiki and lamb souvlaki. </li></ul>", "best_snippet": "... The <font color=#DA3743>lamb souvlaki</font> and lamb chops best we have ever had and we are from NZ! tried to return to try the chicken but was booked out, you must book early. ...", "candidate_snippets": "<ul><li> The lamb souvlaki and lamb chops best we have ever had and we are from NZ! <font color=#60B2D0> (senitment: 1.00, other tags: 0) </font> </li><li> For my entree, I had the lamb souvlaki and enjoyed every bite. <font color=#60B2D0> (senitment: 0.50, other tags: 0) </font> </li><li> Lamb Souvlaki was great and the tzatziki sauce was super fresh and tasty. <font color=#60B2D0> (senitment: 0.48, other tags: 0) </font> </li><li> I had the Lamb Souvlaki --the lamb was very tender, beautifully seasoned and my friend the Moussaka, also very tastey. <font color=#60B2D0> (senitment: 0.22, other tags: 1) </font> </li><li> The food was fantastic: we had the chicken and the lamb souvlaki. <font color=#60B2D0> (senitment: -0.10, other tags: 0) </font> </li><li> The lamb souvlaki was well cooked and tasty, but the meat was suboptimal, with tendons and other stuff the knife could not deal with. <font color=#60B2D0> (senitment: -0.12, other tags: 0) </font> </li>", "dish_name": "Lamb Souvlaki"}, {"reviews_with_mentions": "<ul><li> Hosted a group of 6 from work for a special celebration.  When half of us arrived a bit early for our 8:30 PM reservation, we were seated right away. Didn't have to wait for everyone to arrive like many other establishments. We had the best table in the house. We were seated in front of the bread table in front of the open pit grilling a whole lamb and lots of whole chickens. Our server was fun, friendly, & knowledgeable. <font color=#60B2D0>  <b>Lamb riblets</b> were flavorful, octopus was melt in your mouth tender, and the saganaki was delicious.</font> Order more than one! Our table ordered the sole, bass, lamb shank, grilled lamb special, and the roasted chicken. All were mouth watering. Definite do over. </li><li> Kokkari is a fantastic place to go when you just want to have something different that you wouldn't cook at home.  <font color=#60B2D0> On this occasion we had the <b>lamb riblets</b> (juicy falling off the bone delicious), heirloom tomato salad, and great craft cocktails.</font>  Highly recommended. </li><li> This was a winner--no wait! Very pleasant and funny staff. My daughter & I had 3 appetizers, which were excellent. There was enough to share. <font color=#60B2D0> The <b>lamb riblets</b> (7) were fantastic, the zuchini cakes (2) with yoghurt sauce were very tasty.</font> The dolmas were a little oily for my taste but fresh. The salads were not special but what can you do with a Greek salad--it was authentic (having had many in Greece) fresh & crunchy. The Duckhorn went well with the meal and we had room for the custard dessrt in filo with ice cream. We loved the ambience, perfect on a cold, rainy day. Be sure you have reservations! </li><li> Dined on a Friday afternoon with work friends.  Everyone enjoyed their meal.  <font color=#60B2D0> Starters were fantastic, especially octopus, fried cheese, <b>lamb riblet</b> and smelts.</font>  Our group also enjoyed their entrees.  Delicious ravioli dish was a hit as was the grilled octopus salad.  We enjoyed a lovely Greek white wine from Santorini and several desserts, including the amazing baklava with ice cream!  Service was spot on from the warm greeting when we entered through the entire meal.  Consistent Excellence! </li><li> I was introduced to this place a couple of weeks ago, when I went for a birthday celebration.  I immediately made another reservation for the week after and the food and experience was just as good, if not better.  <font color=#60B2D0> We ordered the octopus and the <b>lamb riblets</b>, the artichoke skewers and the lamb meatballs.</font>  There was just two of us, so that was actually enough for dinner.  It was all perfection and delicious.  I wanted to order more but my tummy was full.  The wines were outstanding.  I stayed away from greek wines, as I am not familiar, but this would be the place to test new wines, so I will next time.  The pro of going with a big group is you try more food (family style) and you are not stuffed.  I will have to bring more people next time. </li><li> We were glad to have an Open Table reservation as this place filled up quickly around us as we changed our 12:15 pm reservation to 11:30 am as our schedule permitted arriving when Kokkari opened.  Monday taverna mussel special was an easy choice, served with grilled bread to sop up the tasty sauce, and did not disappoint.   The smelt starter was generous, served with garlicky Skordalia pur?e.  The waiter revealed chickpea flour and soy oil preparation was the secret to the light, miraculously virtually greaseless fried smelt.  <font color=#60B2D0>  <b>Lamb riblets</b> were tasty as was eggplant 'melitzanosalata' with pita bread.</font>  Kokkari for lunch was more pleasant and quiet than the Palo Alto sister restaurant Evvia, where tasty food is also served. </li><li> LOVED everything about the entire experience!  Found great reviews on Yelp and our dinner still exceeded all expectations!  Wanted to try everything so opted to not to get an entree but dive into all their awesome appetizers.  <font color=#60B2D0> Had the <b>lamb riblets</b> (#1 thing to try), grilled octopus, lamb meatballs, grape leaves, hummus and pita (although its not called hummus), fried zucchini and spanikopita.</font>  I would pretty much order everything again because it really was a feast.  Then for dessert we got the baklava (I'm a huge fan and had to try it) and subbed the ice cream for baklava ice cream too (our waitress said we could order like this since I was stuck between the too).  OMG was all we kept saying all night and I'd HIGHLY recommend this place! </li><li> Our one hour lunch turned out to be almost three hours, not because it takes a long time for them to serve food, but because we wanted to try everything. The menu was so good that we can't decide what to order so we decided to taste different appetizers. The food was really good. I can't eat gluten but everyone else liked the Kalamata Pita. <font color=#60B2D0> We also stuffed ourselves with Roasted Squash, grilled sardine and Pantzaria (roasted beets), Fried Smelts, Grilled Octopus, and Grilled <b>Lamb Riblets</b>.</font> We also tried the grilled whole Mediterranean sea bass. We definitely will go back there again! </li><li> Food was outstanding. Grilled octopus was good, and. Stuffed calamari were a favorite at our table. The grilled artichokes were also very good. <font color=#60B2D0> I would skip the <b>lamb riblets</b> - lamb is too fatty to make this preparation palatable.</font> I recommend getting multiple appetizers and salads and skipping the main courses, which are good, but I always find apps more interesting. </li></ul>", "best_snippet": "... <font color=#DA3743>Lamb riblets</font> were flavorful, octopus was melt in your mouth tender, and the saganaki was delicious. Order more than one! Our table ordered the sole, b ...", "candidate_snippets": "<ul><li> Lamb riblets were flavorful, octopus was melt in your mouth tender, and the saganaki was delicious. <font color=#60B2D0> (senitment: 1.00, other tags: 0) </font> </li><li> On this occasion we had the lamb riblets (juicy falling off the bone delicious), heirloom tomato salad, and great craft cocktails. <font color=#60B2D0> (senitment: 0.90, other tags: 0) </font> </li><li> The lamb riblets (7) were fantastic, the zuchini cakes (2) with yoghurt sauce were very tasty. <font color=#60B2D0> (senitment: 0.30, other tags: 0) </font> </li><li> Starters were fantastic, especially octopus, fried cheese, lamb riblet and smelts. <font color=#60B2D0> (senitment: 0.20, other tags: 0) </font> </li><li> We ordered the octopus and the lamb riblets, the artichoke skewers and the lamb meatballs. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> Lamb riblets were tasty as was eggplant 'melitzanosalata' with pita bread. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> Had the lamb riblets (#1 thing to try), grilled octopus, lamb meatballs, grape leaves, hummus and pita (although its not called hummus), fried zucchini and spanikopita. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> We also stuffed ourselves with Roasted Squash, grilled sardine and Pantzaria (roasted beets), Fried Smelts, Grilled Octopus, and Grilled Lamb Riblets. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> I would skip the lamb riblets - lamb is too fatty to make this preparation palatable. <font color=#60B2D0> (senitment: -0.20, other tags: 0) </font> </li>", "dish_name": "Lamb Riblets"}, {"reviews_with_mentions": "<ul><li> From the moment we arrived, the service was impeccable! Our server guided us through the menu, making suggestions and advising when needed.   Every course was delicious! <font color=#60B2D0> Best <b>Halibut</b> I have ever had.</font> And the wine list was outstanding.  Would recommend Kokkari to anybody, and will definitely go back the next time I visit San Francisco. </li><li> My husband and I enjoyed several appetizers (3 because we couldn't decide on just 2!) and all were great - the beets, the brussel sprouts and the the stuffed calamari. <font color=#60B2D0> He had the fresh <b>halibut</b> which was excellent and I had the goat stew which was wonderful then and just as good for lunch the next day!</font> The chocolate was rich and yummy and the special dessert that I had was excellent too; I'm not sure you can go wrong there. The service was very friendly and attentive without being intrusive. I'm really looking forward to going back ... </li><li> Totally enjoyed our dinner! Great appetizers, huge wine list, fine dinner choices. <font color=#60B2D0> Ordered <b>halibut</b> on a bed of roasted lentil, outstanding.</font>  </li><li> The years of consistently excellent food presentations and service are testament to Kokkari's attention and class. It is always a joy to dine here and introduce Kokkari to more friends from near and far. One of our guests and I had the pork special on Saturday night, the others mostly had fish. <font color=#60B2D0>  <b>halibut</b>).</font> The wine list is extensive and includes a good selection of reasonably priced varietals, red and white, from California, as well as Greece and Italy. Wish I could go there once a week! </li><li> Every dish had fresh and tasty ingredients. Great flavored and we tried several appetizers--all excellent! Main entrees melt in your mouth. <font color=#60B2D0> I had <b>halibut</b> over black lentils and lived every bite.</font> Husband ordered lamb chops which were excellent but wants to try lamb rotisserie next time because looked so good! Best food of our SF vacation. </li></ul>", "best_snippet": "... Best <font color=#DA3743>Halibut</font> I have ever had. And the wine list was outstanding.  Would recommend Kokkari to anybody, and will definitely go back the next time I visi ...", "candidate_snippets": "<ul><li> Best Halibut I have ever had. <font color=#60B2D0> (senitment: 1.00, other tags: 0) </font> </li><li> He had the fresh halibut which was excellent and I had the goat stew which was wonderful then and just as good for lunch the next day! <font color=#60B2D0> (senitment: 0.60, other tags: 1) </font> </li><li> Ordered halibut on a bed of roasted lentil, outstanding. <font color=#60B2D0> (senitment: 0.50, other tags: 0) </font> </li><li> (halibut). <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> I had halibut over black lentils and lived every bite. <font color=#60B2D0> (senitment: -0.17, other tags: 0) </font> </li>", "dish_name": "Halibut Steak"}, {"reviews_with_mentions": "<ul><li> Both Evvia in Palo Alto and Kokkari in San Francisco share the same menu but the size of this location allows that wonderful bar and rotisserie in the front section. The menu has all the Greek basics and you can make a meal out of the appetizers- which are not so basic. The seasonal menu was exceptional as well. Lamb is an exceptional surprise as you might expect. <font color=#60B2D0> I tried the <b>goat stew</b> this time and it was so delicious.</font> I don't know how many times I've been here but it is my go to place in a city that has many wonderful options. It is a beautiful place with great service and exceptional food. Take visitors. </li><li> We took the advice of locals and Fodors to make sure we came here while in San Francisco. We were not disappointed.  <font color=#60B2D0> My husband and I both loved our meals (the <b>goat stew</b> was particularly good) and the wine.</font> Our waiter - George - was fabulous. We loved the ambiance too.  Recommend asking for a table in the back room, we the front seemed pretty noisy and crowded. </li><li> My husband and I enjoyed several appetizers (3 because we couldn't decide on just 2!) and all were great - the beets, the brussel sprouts and the the stuffed calamari. <font color=#60B2D0> He had the fresh halibut which was excellent and I had the <b>goat stew</b> which was wonderful then and just as good for lunch the next day!</font> The chocolate was rich and yummy and the special dessert that I had was excellent too; I'm not sure you can go wrong there. The service was very friendly and attentive without being intrusive. I'm really looking forward to going back ... </li><li> I was given a gift certificate to Kookari this Christmas, and decided to go when my sister-in-law was in town. <font color=#60B2D0> We had an amazing white wine from Santorini -- an assortment of delicious appetizers, a yummy <b>goat stew</b>, and really well prepared sole.</font> We will definitely return. </li><li> My boyfriend and I came here to celebrate his birthday while vacationing in San Francisco. I had never been to a Greek 'fine-dining' restaurant before and was excited to see what the menu had to offer. We had the prawn appetizer--delicious! <font color=#60B2D0> For mains, I had the vegetable ravioli and my boyfriend had a special, a <b>goat stew</b>.</font> While my dish was good (and I would definitely recommend to vegetarians), it didn't even compare to the goat stew which was absolutely outstanding! The only thing better than the food was the service, which was top notch. I can't wait to return the next time I'm in the bay area. </li><li> My boyfriend ate here last Sunday, after he ran the SF marathon. We simply loved the restaurant. It is beautiful, the service was simply amazing. Our waiter Jeff, was perfect. All the staff we came into contact with were top notch. Food -- unbelievable!!! <font color=#60B2D0> We tried the prawns, the duck stuffed grape leaves, the roasted eggplant, the <b>goat stew</b> and the grilled whole fish.</font> Scrumptious, all. The only down side is that we were so full, we didn't leave room for dessert. Next time... </li><li> I had an amazing birthday dinner with 7 of my closest friends at Kokkari.  The service was incredible, even with our rowdy bunch.  The sommelier is spot on in his recommendations (and really handsome to boot).   We ended up ordering dozens of appetizers and then were so full we just order two salads and two entrees to share.  It worked out perfect and we got to try so many of the delicious small plates.  <font color=#60B2D0> Everybody was thrilled by the complex and uniquely flavored dishes, which was interesting because Mediterranean has very typical flavors- beet salad, <b>goat stew</b>, meatballs, yum!</font>  Desserts were delicious- they brought out a flourless chocolate cake for my birthday and we also ordered the bread pudding and ice cream- I'd recommend them all </li><li> Let me list the delicious appetizers we had: Wooden roasted prawns,Grilled octopus, Sardines, Lamb tongue, Green leafy vegetable. They were all good appetizers! The best for me was the roasted prawns. <font color=#60B2D0> For our main entree, my husband and I shared the <b>goat stew</b> with artichokes on a bed of orzo.</font> To end our meal we ordered the baklava (shredded phillo dough, whipped cream and crushed pistachios). It was yummy!  Our friends had the lamb chops (it looked good), and for their dessert they ordered and shared with us the meyer lemon cake with ice cream. Our waiter recommended round pound cabernet sauvignon and it was good! </li><li> Nothing you consume here can be wrong. The whole fish that he ordered me was traditionally grilled with all the essential Mediterranean spices. <font color=#60B2D0> The <b>goat stew</b> was neither gamey nor tough but melts in my mouth with the tantalizing release of all the fragrant exotic herbs.</font>  Desert was a masterpiece that I could not possible pronounce but it was a modest custard filled filo with an adornment of pistachio ice cream that I would only hope to perfect if I ever decide to bake at one point in my life. Oh, bypass the Greek coffee and opt for an ouzo if you don't want to lay awake at 3am wondering when you'll ever be able to head back to the island of Kokkari Estiatorio.  N?stima was the word uttered over and over again and again.. </li><li> Kokkari is a beautiful restaurant, but it is all about the food. <font color=#60B2D0> I tasted all the food at our table for four, but the stand outs were the <b>goat stew</b>, the grilled whole sea bass and the duck meatballs wrapped in pastry.</font> The goat stew is not always on the menu, but if it is, I highly recommend it. It's hearty, not heavy, and has wonderful flavors. The sea bass was grilled and de-boned in the kitchen. It had simple seasonings so that the delicate bass flavor came out. The duck meatballs were quite tasty - just the right size for four people to taste. We also had a tasty flat bread appetizer. For dessert, do not miss the made-to-order donut holes with walnuts and honey. YUM! I love this place! </li><li> Kokkari was absolutely delicious!  My husband and I ordered the grilled lamb meatballs as an appetizer.  <font color=#60B2D0> My husband had the <b>goat stew</b> with orzo and I had the lamb chops for dinner.</font>  I highly recommend the lamb chops! They were the best I've ever had! </li></ul>", "best_snippet": "... I tried the <font color=#DA3743>goat stew</font> this time and it was so delicious. I don't know how many times I've been here but it is my go to place in a city that has many w ...", "candidate_snippets": "<ul><li> I tried the goat stew this time and it was so delicious. <font color=#60B2D0> (senitment: 1.00, other tags: 0) </font> </li><li> My husband and I both loved our meals (the goat stew was particularly good) and the wine. <font color=#60B2D0> (senitment: 0.70, other tags: 0) </font> </li><li> He had the fresh halibut which was excellent and I had the goat stew which was wonderful then and just as good for lunch the next day! <font color=#60B2D0> (senitment: 0.60, other tags: 1) </font> </li><li> We had an amazing white wine from Santorini -- an assortment of delicious appetizers, a yummy goat stew, and really well prepared sole. <font color=#60B2D0> (senitment: 0.36, other tags: 0) </font> </li><li> For mains, I had the vegetable ravioli and my boyfriend had a special, a goat stew. <font color=#60B2D0> (senitment: 0.36, other tags: 0) </font> </li><li> We tried the prawns, the duck stuffed grape leaves, the roasted eggplant, the goat stew and the grilled whole fish. <font color=#60B2D0> (senitment: 0.20, other tags: 1) </font> </li><li> Everybody was thrilled by the complex and uniquely flavored dishes, which was interesting because Mediterranean has very typical flavors- beet salad, goat stew, meatballs, yum! <font color=#60B2D0> (senitment: 0.18, other tags: 0) </font> </li><li> For our main entree, my husband and I shared the goat stew with artichokes on a bed of orzo. <font color=#60B2D0> (senitment: 0.17, other tags: 0) </font> </li><li> The goat stew was neither gamey nor tough but melts in my mouth with the tantalizing release of all the fragrant exotic herbs. <font color=#60B2D0> (senitment: 0.06, other tags: 0) </font> </li><li> I tasted all the food at our table for four, but the stand outs were the goat stew, the grilled whole sea bass and the duck meatballs wrapped in pastry. <font color=#60B2D0> (senitment: 0.02, other tags: 0) </font> </li><li> My husband had the goat stew with orzo and I had the lamb chops for dinner. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li>", "dish_name": "Goat Stew"}, {"reviews_with_mentions": "<ul><li> We went to celebrate our anniversary and our friend's birthday.  Made reservations and were immediately seated.  We had a WONDERFUL and energetic waiter, Michael. <font color=#60B2D0> Most of the dishes we felt were delicious: <b>lamb shank</b>, moussaka, octopus, calamari.</font>  We were disappointed with the rotisserie of the evening which was lamb, felt it very bland in taste. Delicious dessert we shared (so full, took food home)-nicely presented for the celebrations but I did feel they should have comped the dessert--good will!! All in all a memorable place to celebrate. </li><li> I'm glad that I made reservations at Kokkari for our anniversary dinner. Although we weren't seated in the main dining room with the plush full-back chairs & fireplace, I was still impressed with the rustic charm that was present in the back dining area. Our waiter was very knowledgeable & provided excellent service throughout the meal. We brought our own wine to dinner and it accompanied the meal very well. I will say that the portions sizes are very generous, so you could easily share an entree if you wanted to. My husband ordered the lamb chops which were fine except just a tad chewy. <font color=#60B2D0> I ordered the famous <b>braised lamb shank</b>, and while delicious, I had to give up on the dish after about 10 bites - it was just too filling!</font> Order lightly :) </li><li> Excellent, food, service and very friendly staff. The roasted lamb over the fire is wonderful, full of flavor, moist and tender. The zucchini cakes are fresh, crisp and a must to try. <font color=#60B2D0> The house wine Cab Sav was smooth and perfect with my <b>lamb shank</b>.</font> Highly recommend eating here, don't rush your evening, savor the food. You must book! </li><li> 5 stars for everything!  <font color=#60B2D0> Great hostess at the front, always incredible restaurant managers that remember your name/where you like to sit, very attentive waiters that listen to exactly how you want your meal served, and the best <b>lamb shank</b> in the country.</font>  I'm a healthy eater, and I like that they cook in light oils and have several fresh seafood choices. I wish they had their Fri rotisserie chicken every day! </li><li> I booked a table for my wife's birthday celebration. After reading about the great reviews online, we had higher than average expectations of this place. It definately exceeded all of our expectations! <font color=#60B2D0> The vibe was phenomenal, service was attentive without being overly interruptive and food was great.. the meat just fell off the bone for the <b>lamb shank</b>!</font> We will definately go back again. </li><li> I expected a lot when I got here because everything I had heard was stellar,  and I had rationalized that young techies might have reviewed and maybe they didn't know crap. I was wrong. From constant calls I had made to try and get in early to the over accommodating bus boy the service was tremendous.  I had forgotten my reading glasses. They had a choice of 30 for me to use that were shown to me by the extremely professional waiter. The wine list matched the excellence of the food. The octopus was great and a must. <font color=#60B2D0> The salad was creative, my <b>lamb shank</b> was out of this work and my wife loved the king salmon.</font> The $200. Tab incl. Tip was well worth it.  The bottle of wine (Saldo Zinfandel) was tremendous! </li><li> The service was perfect! and Jeff, our waiter, knew the perfect wine pairing with each course. The food was extremely well prepared and presented. We were very happy with the whole experience including appetizers, main courses and dessert (not to be missed). Since it is a Greek restaurant we chose what we thought would be most authentic: grilled octopus, asparagus with crumbled myzithra and herbs and lamb meatballs. All were delicious. I would not get the grilled octopus again, but it was nice to experience. Entrees were outstanding! <font color=#60B2D0> Whole fish off of the grill(they even deboned it) and the <b>lamb shank</b> tender and flavorful.</font> Desserts were also fabulous with the Greek \"donuts\" and homemade baklava plus ouzo and more wine.  We LOVED it! </li><li> Our evening was a very impressive dining experience for our daughter's birthday celebration. Frank, our server, started us off with guidance in the choice of a Greek wine (extensive wine selection) and 4 different starters of calamari, sardines, dolmas and a delicious cheese and crab dip. Excellent choices! You cannot go wrong the the lamb entrees. <font color=#60B2D0> The <b>lamb shanks</b> (tasty seasonings) and lamb chops were cooked to perfection.</font> Be sure to have dessert, especially, the homemade ice cream. Excellent service and food made this an enjoyable experience and one to definitely recommend. </li><li> My fianc? and I kept hearing really great things about Kokkari from people we knew and we always pass by it and it's always packed. We finally decided to eat there for my birthday and it definitely lived up to it's high standards. We ordered about 4 appetizers to share and they were all delicious. We really enjoyed the lamb meatballs and the beet salad appetizer. <font color=#60B2D0> For our entrees we ordered the <b>lamb shank</b> and the lamp chop.</font> Both were perfectly cooked and delicious. Our server and the rest of the wait staff were on top of it and made sure everything was okay. Definitely will go back here to eat and try the rest of their menu. It's moved up to be now one of my favorite restaurants here in SF. </li><li> Hosted a group of 6 from work for a special celebration.  When half of us arrived a bit early for our 8:30 PM reservation, we were seated right away. Didn't have to wait for everyone to arrive like many other establishments. We had the best table in the house. We were seated in front of the bread table in front of the open pit grilling a whole lamb and lots of whole chickens. Our server was fun, friendly, & knowledgeable. Lamb riblets were flavorful, octopus was melt in your mouth tender, and the saganaki was delicious. Order more than one! <font color=#60B2D0> Our table ordered the sole, bass, <b>lamb shank</b>, grilled lamb special, and the roasted chicken.</font> All were mouth watering. Definite do over. </li><li> Our best restaurant experience in San Fran. <font color=#60B2D0> Spiced lamb meat balls, zucchini cakes, <b>braised lamb</b> casserole, roasted lemon chicken.</font> Excellent! </li><li> I do love this place and I think it was a bit of an off night.  There were a few big parties that may have thrown things off.  Our server was amazing, but the one at the table next to us was a mess and it was distracting.  <font color=#60B2D0> I had the <b>lamb shank</b> which was not to my liking, but I dont think it was bad, just not my taste.</font>  </li></ul>", "best_snippet": "... Most of the dishes we felt were delicious: <font color=#DA3743>lamb shank</font>, moussaka, octopus, calamari.  We were disappointed with the rotisserie of the evening which was ...", "candidate_snippets": "<ul><li> Most of the dishes we felt were delicious: lamb shank, moussaka, octopus, calamari. <font color=#60B2D0> (senitment: 0.75, other tags: 1) </font> </li><li> I ordered the famous braised lamb shank, and while delicious, I had to give up on the dish after about 10 bites - it was just too filling! <font color=#60B2D0> (senitment: 0.75, other tags: 0) </font> </li><li> The house wine Cab Sav was smooth and perfect with my lamb shank. <font color=#60B2D0> (senitment: 0.70, other tags: 0) </font> </li><li> Great hostess at the front, always incredible restaurant managers that remember your name/where you like to sit, very attentive waiters that listen to exactly how you want your meal served, and the best lamb shank in the country. <font color=#60B2D0> (senitment: 0.69, other tags: 0) </font> </li><li> The vibe was phenomenal, service was attentive without being overly interruptive and food was great.. the meat just fell off the bone for the lamb shank! <font color=#60B2D0> (senitment: 0.63, other tags: 0) </font> </li><li> The salad was creative, my lamb shank was out of this work and my wife loved the king salmon. <font color=#60B2D0> (senitment: 0.60, other tags: 0) </font> </li><li> Whole fish off of the grill(they even deboned it) and the lamb shank tender and flavorful. <font color=#60B2D0> (senitment: 0.20, other tags: 1) </font> </li><li> The lamb shanks (tasty seasonings) and lamb chops were cooked to perfection. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> For our entrees we ordered the lamb shank and the lamp chop. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li><li> Our table ordered the sole, bass, lamb shank, grilled lamb special, and the roasted chicken. <font color=#60B2D0> (senitment: -0.10, other tags: 0) </font> </li><li> Spiced lamb meat balls, zucchini cakes, braised lamb casserole, roasted lemon chicken. <font color=#60B2D0> (senitment: -0.60, other tags: 1) </font> </li><li> I had the lamb shank which was not to my liking, but I dont think it was bad, just not my taste. <font color=#60B2D0> (senitment: -0.70, other tags: 0) </font> </li>", "dish_name": "Braised Lamb Shank"}, {"reviews_with_mentions": "<ul><li> Kokkari's has the most amazing fresh Greek food! Loved everything, and the service was great. We went on President's day for lunch, so no problem getting a reservation. If you plan to go on a non-holiday, book in advance as they get booked fast. Go with a bunch of friends and share a little of everything. Calamari was super fresh. Whole sea bass was cooked perfectly. Lamb Souvlaki was great and the tzatziki sauce was super fresh and tasty. <font color=#60B2D0>  <b>Baklava Ice Cream</b> was fantastic!</font> I love Kokkari's and will definitely be back...if I can get a reservation! </li><li> LOVED everything about the entire experience!  Found great reviews on Yelp and our dinner still exceeded all expectations!  Wanted to try everything so opted to not to get an entree but dive into all their awesome appetizers.  Had the lamb riblets (#1 thing to try), grilled octopus, lamb meatballs, grape leaves, hummus and pita (although its not called hummus), fried zucchini and spanikopita.  I would pretty much order everything again because it really was a feast.  <font color=#60B2D0> Then for dessert we got the baklava (I'm a huge fan and had to try it) and subbed the ice cream for <b>baklava ice cream</b> too (our waitress said we could order like this since I was stuck between the too).</font>  OMG was all we kept saying all night and I'd HIGHLY recommend this place! </li><li> The food and service were excellent, and the ambiance was very nice. <font color=#60B2D0> We had dinner for two, we ordered a red wine from Napa, had the grilled octopus with lemon (Octapodaki you Yiorgou), the lamb chops (Arnisia Paidakia) and for dessert the yogurt sorbet (Yiaourti Granita) and <b>Baklava ice cream</b> (Pagoto Baklava) with a Greek coffee.</font> Eating at Kokkari should be at the top of any list for visitors going to SF. Looking forward to returning on my next trip to San Francisco. </li></ul>", "best_snippet": "... <font color=#DA3743>Baklava Ice Cream</font> was fantastic! I love Kokkari's and will definitely be back...if I can get a reservation! ...", "candidate_snippets": "<ul><li> Baklava Ice Cream was fantastic! <font color=#60B2D0> (senitment: 0.50, other tags: 0) </font> </li><li> Then for dessert we got the baklava (I'm a huge fan and had to try it) and subbed the ice cream for baklava ice cream too (our waitress said we could order like this since I was stuck between the too). <font color=#60B2D0> (senitment: 0.40, other tags: 0) </font> </li><li> We had dinner for two, we ordered a red wine from Napa, had the grilled octopus with lemon (Octapodaki you Yiorgou), the lamb chops (Arnisia Paidakia) and for dessert the yogurt sorbet (Yiaourti Granita) and Baklava ice cream (Pagoto Baklava) with a Greek coffee. <font color=#60B2D0> (senitment: 0.00, other tags: 0) </font> </li>", "dish_name": "Baklava Ice Cream"}]