[{"reviews_with_mentions": "<ul><li> <font color=#60B2D0> Great for a <b>business lunch</b> with healthy options.</font> Make reservations to avoid any wait. </li><li> <font color=#60B2D0> Great for <b>business lunch</b> or reprieve from shopping hustle and bustle.</font>  </li><li> <font color=#60B2D0> Excellent place for a convenient and quite place to hold a <b>business meeting</b>.</font> Something for everyone on the menu and sound level works well for conversation. Honored reservation, did not have to wait. </li><li> Took my co-worker out for lunch and we went before the noon crowd. Felt good personal attention -- food was great -- price was good -- we were in and out in just over an hour (of course we spent time talking so not all the restaurants fault). <font color=#60B2D0> Would recommend this for <b>business lunch</b>.</font>  </li><li> <font color=#60B2D0> A good spot for a <b>business lunch</b>.</font> A broad menu with many fresh and healthy alternatives. Service on the patio was slow, but it was very quiet. </li><li> <font color=#60B2D0> I went for a <b>lunch meeting</b> and was really impressed that they sat us in a quiet section, did not rush or swarm us during the 3 hours the meeting took and also were attentive.</font> Will definitely return. </li><li> This restaurant was great in all regards. <font color=#60B2D0> When I made reservations, I asked for a table that was not terribly noisy, as it was a <b>business lunch</b>, and we were seated at the perfect table.</font> The service was over the top, attentive, courteous, friendly. I am from New Orleans and my pallet is used to very tasty food. I ordered the Mediterranean Salad ans asked if I could add grilled shrimp. The waitress paused and said, sure you can. I knew she was going to make it happen. The salad was excellent. An abundance of everything. I recommend Seasons 52! Oh, and all ingredients are fresh and local and 495 calories or fewer, which is why I chose to give it a try. You won't be disappointed. </li><li> <font color=#60B2D0> Went for <b>business meeting</b> and while the booth was nice, without there being a wall, sound travels from outside to the interior.</font> Had to keep asking my lunch partner to repeat what he said. </li></ul>", "best_snippet": "... Great for a <font color=#DA3743>business lunch</font> with healthy options. ...", "candidate_snippets": "<ul><li> Great for a business lunch with healthy options. <font color=#60B2D0> (senitment: 0.95) </font> </li><li> Great for business lunch or reprieve from shopping hustle and bustle. <font color=#60B2D0> (senitment: 0.89) </font> </li><li> Excellent place for a convenient and quite place to hold a business meeting. <font color=#60B2D0> (senitment: 0.87) </font> </li><li> Would recommend this for business lunch. <font color=#60B2D0> (senitment: 0.86) </font> </li><li> A good spot for a business lunch. <font color=#60B2D0> (senitment: 0.75) </font> </li><li> I went for a lunch meeting and was really impressed that they sat us in a quiet section, did not rush or swarm us during the 3 hours the meeting took and also were attentive. <font color=#60B2D0> (senitment: 0.71) </font> </li><li> When I made reservations, I asked for a table that was not terribly noisy, as it was a business lunch, and we were seated at the perfect table. <font color=#60B2D0> (senitment: 0.66) </font> </li><li> Went for business meeting and while the booth was nice, without there being a wall, sound travels from outside to the interior. <font color=#60B2D0> (senitment: 0.60) </font> </li>", "dish_name": "Good for a Business Meeting"}]