[{"RESTAURANTID":114544,"RESTAURANTNAME":"Faith & Flower - Coastal Luxury Mgmt","REVIEWTEXT":"Heard about F&F a couple months ago and when I saw it was participating in Restaurant Week, I knew it was time to pay it a visit. Started off with some delicious ceviche served with potato chips and followed it up with fennel citrus salad that had some subtle yet amazing flavors. The ginger braised short rib is perfectly accompanied by garlic & crab rice. My favorite thing of the meal was the bacon broth they pour over the sea bass. The hazelnut dessert was a wonderful way to wrap things up. Oh! I almost forgot about the English Milk Punch cocktail. I've never had anything like it. I can see why it's their signature drink.","BVREVIEWID":71115786,"OVERALL":5,"DINED_DATE_LOCAL":"2015-01-28 18:30:00.0","event":"DineLA Restaurant Week","rid":114544,"sentiment":0.8790259609},{"RESTAURANTID":114544,"RESTAURANTNAME":"Faith & Flower - Coastal Luxury Mgmt","REVIEWTEXT":"It was really flawless. The place is really art deco shiny. Lots of glass, mirrors, and some potted palms and other plants. We ordered one Restaurant Week Prix Fixe and several other dishes off the menu -- which is actually a book with 11 chapters!! All told, we sampled: Fennel and Citrus Salad (really well put together, the pistachios and manchego made it sparkle!), the Poached Farm Egg (WHO knew eggs could taste so silken and buttery and sublime? If someone poached me an egg like this, I would eat breakfast every morning. Served over quinoa and assorted greens), Kanpachi Ceviche (the best I've ever had in my life! Ginger beer in the ceviche and served with homemade kettle chips? Yes, please!), Lamb Pierogies (UMMMM, so melty! Salty, savory, delicious caramelized onions, rich broth), Oxtail Agnolotti (WOW. So much WOW! Cannot be explained, I'm just glad we got it; no wonder it's the most popular on the menu!), Sauteed Blue Lake Green Beans (prob our least favorite, but that's not say","BVREVIEWID":71024666,"OVERALL":5,"DINED_DATE_LOCAL":"2015-01-25 21:45:00.0","event":"DineLA Restaurant Week","rid":114544,"sentiment":0.5884869578},{"RESTAURANTID":117115,"RESTAURANTNAME":"Herringbone - Los Angeles","REVIEWTEXT":"We enjoyed eating here for Restaurant Week on a Saturday night. It was very lively and nice crowd.  We had a romantic table by the window with a private firepit. Everything was delicious and it was great service too!","BVREVIEWID":70952247,"OVERALL":5,"DINED_DATE_LOCAL":"2015-01-24 20:30:00.0","event":"DineLA Restaurant Week","rid":117115,"sentiment":0.993427452},{"RESTAURANTID":25516,"RESTAURANTNAME":"MEET in Paris","REVIEWTEXT":"Pate & bouillabaisse for my friend was outstanding.  I had the restaurant week price fix.  Arugula & endive salad was amazing with the steak & chocolate dessert.   Cannot wait to go back.  Excellent meal.","BVREVIEWID":71153709,"OVERALL":5,"DINED_DATE_LOCAL":"2015-01-29 19:00:00.0","event":"DineLA Restaurant Week","rid":25516,"sentiment":0.9925898025},{"RESTAURANTID":48805,"RESTAURANTNAME":"Mistral - Sherman Oaks","REVIEWTEXT":"Dined here for Restaurant Week. Food was wonderful.  Rack of Lamb cooked to perfection. Service was attentive, they couldn't do enough for us.  Will definitely return.","BVREVIEWID":70954590,"OVERALL":5,"DINED_DATE_LOCAL":"2015-01-24 19:00:00.0","event":"DineLA Restaurant Week","rid":48805,"sentiment":0.9919743582},{"RESTAURANTID":52402,"RESTAURANTNAME":"Cafe Bizou - Sherman Oaks","REVIEWTEXT":"Came here for LA restaurant week. They had a great deal on a three course meal, from start the to finish it was delicious!","BVREVIEWID":70937968,"OVERALL":4,"DINED_DATE_LOCAL":"2015-01-24 17:30:00.0","event":"DineLA Restaurant Week","rid":52402,"sentiment":0.978087052},{"RESTAURANTID":7898,"RESTAURANTNAME":"Taste on Melrose","REVIEWTEXT":"Dined during DineLA Restaurant Week. First time dining here, and our meal was delicious. Tried the bacon Mac and Cheese, & the Steak with truffle potato croquettes. Both were yummy and portion sizes were \"right sized\". The chocolate bread pudding is a must try!! So delicious!!!  We were seated in the outside patio area. It was warm as they have heaters but the seating was so close together that we could hear the table next to us entire conversation. Maybe the inside seating is better? idk. Valet parking is about $5.","BVREVIEWID":70793697,"OVERALL":4,"DINED_DATE_LOCAL":"2015-01-21 19:45:00.0","event":"DineLA Restaurant Week","rid":7898,"sentiment":0.9694604746},{"RESTAURANTID":2502,"RESTAURANTNAME":"Arroyo Chop House","REVIEWTEXT":"We went to Mastro's Steakhouse a couple of weeks ago, and it pales in comparison to Arroyo.  We always head to Arroyo for restaurant week and it again didn't disappoint.  The sourdough bread is outstanding, the steaks are the best I've had in the area, and their caramelized sweet corn side dish is so good.","BVREVIEWID":71250872,"OVERALL":5,"DINED_DATE_LOCAL":"2015-01-31 17:30:00.0","event":"DineLA Restaurant Week","rid":2502,"sentiment":0.9690733314},{"RESTAURANTID":145528,"RESTAURANTNAME":"Blue Plate Oysterette - Hollywood","REVIEWTEXT":"Dined during DineLa Restaurant Week. Dinner was so yummy!  The butternut squash soup with crab was so delicious and had lots of fresh crab! Then crab cakes were also very good! The lobster roll is a must try!!! So Yummy!! The sorbet for dessert was very refreshing!  Valet parking is $8.  Good service was quick although the restaurant was busy, I loved that! The server was friendly.  Atmosphere was fun and casual setting. Decor was modern. Overall, loved my dining experience here!","BVREVIEWID":70715197,"OVERALL":5,"DINED_DATE_LOCAL":"2015-01-19 19:00:00.0","event":"DineLA Restaurant Week","rid":145528,"sentiment":0.9351999945},{"RESTAURANTID":49795,"RESTAURANTNAME":"Brunello Trattoria","REVIEWTEXT":"We had a party of 4 for DineLA.  Everyone enjoyed their 3 course meals.  The portions were quite generous and of great quality.  Happy we include Brunello's for Restaurant Week every year and several times in between.","BVREVIEWID":71197978,"OVERALL":5,"DINED_DATE_LOCAL":"2015-01-30 18:00:00.0","event":"DineLA Restaurant Week","rid":49795,"sentiment":0.9348145687},{"RESTAURANTID":2580,"RESTAURANTNAME":"Saddle Peak Lodge","REVIEWTEXT":"We dined on a Wednesday and the restaurant was not busy. We had the DineLA Restaurant Week menu which was shown as 3 courses but included several delicious amuse-bouche bites. Saddle Peak Lodge specializes in game and I was quite happy with my venison carpaccio starter and elk tenderloin entr?e. The service was attentive without being intrusive and the room was quiet, a refreshing change from the noise often found in other places.","BVREVIEWID":70798645,"OVERALL":5,"DINED_DATE_LOCAL":"2015-01-21 19:00:00.0","event":"DineLA Restaurant Week","rid":2580,"sentiment":0.924813216}]