[{"RESTAURANTID":775,"RESTAURANTNAME":"Brasserie 8 1\/2","REVIEWTEXT":"Went with friends for restaurant week and was surprised the place was empty.  Everything was delicious and the service was friendly.  The place is a little dated, some of the chairs look like they were pulled from a Florida retirement home, but the food does not disappoint.  I loved my kale duck salad, the short rib with Brussels sprouts, and most of all the amazing lemon tart for dessert.  My friends all loved their food too, we all cleaned all of our plates.  We had wonderful oysters to start too; so fresh!   We sat in a comfy booth and enjoyed a great bottle of wine as well.  I would definitely recommend Brasserie 8 1\/2.","BVREVIEWID":74397086.0,"OVERALL":4,"DINED_DATE_LOCAL":"2015-03-02 19:30:00.0","event":"NYC Restaurant Week","rid":775,"sentiment":0.9959910722},{"RESTAURANTID":775,"RESTAURANTNAME":"Brasserie 8 1\/2","REVIEWTEXT":"Made a last minute reservation during NYC Restaurant Week and am glad I did. The food was delicious and well-prepared. The service was excellent. My meal was one of the highlights of my visit to NYC.","BVREVIEWID":75100412.0,"OVERALL":4,"DINED_DATE_LOCAL":"2015-03-03 12:45:00.0","event":"NYC Restaurant Week","rid":775,"sentiment":0.9930565438},{"RESTAURANTID":775,"RESTAURANTNAME":"Brasserie 8 1\/2","REVIEWTEXT":"My friend and I went here during restaurant week for NYC and the meal was superb. They offered decent portions of delicious food at a wonderful price. Excellent wine list. If you aren't in the mood for a full meal they have a lovely little bar and lounge area that is cozy and helpful servers to order cocktails and apps from. Great, courteous service.","BVREVIEWID":78116043.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-19 19:30:00.0","event":"NYC Restaurant Week","rid":775,"sentiment":0.9924585196},{"RESTAURANTID":138868,"RESTAURANTNAME":"Park Avenue Summer","REVIEWTEXT":"We booked a table for restaurant week and we got such good value for money!  The main dishes on the regular menu were the same cost as the restaurant week menu!  The food was excellent - the everything-crusted fish was cooked perfectly and the truffle croquette amuse bouche was so good I wanted about 10 of them.  You can get phenomenal food at many places in NYC, so Park Ave Winter sets itself apart with the gorgeous decor and amazing service.  The waitstaff had the perfect balance of friendly and attentive but giving you time to enjoy the meal and your company.  Overall it was a great dinner and I would recommend to anyone looking for a special night out.","BVREVIEWID":75323271.0,"OVERALL":4,"DINED_DATE_LOCAL":"2015-02-22 19:00:00.0","event":"NYC Restaurant Week","rid":138868,"sentiment":0.9805958351},{"RESTAURANTID":138868,"RESTAURANTNAME":"Park Avenue Summer","REVIEWTEXT":"I can't imagine a more tasteful way to execute this seasonal concept - the winter decor was understated but still clearly winter-esque.. Anyway, the important stuff-  the food: excellent. I went during restaurant week, and my friend and I shared our dishes... The stand-out dish was the everything-crusted branzino. Every food should be crusted in that everything-crust. It was incredible. And the service was outstanding - each waiter\/busser\/misc. staff member was friendly, attentive and courteous. I can't wait for spring so I can go back for the next season!","BVREVIEWID":75138795.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-03-04 21:45:00.0","event":"NYC Restaurant Week","rid":138868,"sentiment":0.9690038658},{"RESTAURANTID":138868,"RESTAURANTNAME":"Park Avenue Summer","REVIEWTEXT":"Usually restaurant week menus seem restricted and limited. It seems park avenue did the opposite and highlighted their best dishes. The steak tartare was delicious the subtle taste of foi gras made it perfect. The pork schnitzel was cooked to perfection and the pear mustard is to die for. With so many restaurants in nyc I would hardly return to one again but this place is different. I am so happy that restaurant week gave me a reason to try this place and I will definitely be coming back for Spring.","BVREVIEWID":73946329.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-23 20:00:00.0","event":"NYC Restaurant Week","rid":138868,"sentiment":0.9602678041},{"RESTAURANTID":5064,"RESTAURANTNAME":"Telepan","REVIEWTEXT":"We went during Restaurant Week and found everything superb.  The menu offered variety, complexity of flavors, and creative combinations that worked very well.  Ambiance was most enjoyable and really added to the overall experience -- nice art, lighting, colors, and noise level.","BVREVIEWID":72789743.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-20 14:00:00.0","event":"NYC Restaurant Week","rid":5064,"sentiment":0.9805010116},{"RESTAURANTID":5064,"RESTAURANTNAME":"Telepan","REVIEWTEXT":"Went there for restaurant week and the lunch  was fabulous with great selections ample portion.  Did not disappoint.  Will definitely go back. Nice classy ambiance and a great neighborhood gem.  They didn't not cheap out on the food quality and portion.  The best restaurant week menu by far.","BVREVIEWID":75362719.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-03-05 12:00:00.0","event":"NYC Restaurant Week","rid":5064,"sentiment":0.9609430482},{"RESTAURANTID":5064,"RESTAURANTNAME":"Telepan","REVIEWTEXT":"Thoroughly enjoyed lunch during Restaurant Week.  Good selections for the 3-course meal.  Tables are separate enough so you can have a private conversation!","BVREVIEWID":72598108.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-19 14:00:00.0","event":"NYC Restaurant Week","rid":5064,"sentiment":0.9586113426},{"RESTAURANTID":6200,"RESTAURANTNAME":"Gotham Bar and Grill","REVIEWTEXT":"Went here for restaurant Week. I had the kale salad, halibut and panna cotta. I also tried the braised beef and the chocolate cake. Everything was delicious. Service is excellent and the place is nice.","BVREVIEWID":73259976.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-23 14:00:00.0","event":"NYC Restaurant Week","rid":6200,"sentiment":0.989548144},{"RESTAURANTID":6200,"RESTAURANTNAME":"Gotham Bar and Grill","REVIEWTEXT":"I love this restaurant. It was everything that I thought it would be. We came here for restaurant week lunch and the food was absolutely delicious. The portions were \"fine dining\" sized but every bite was delicious. I want to come here again for Restaurant Week just to taste the delicious food again. Definitely come here if you get the chance. You won't regret it!","BVREVIEWID":73185400.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-16 13:45:00.0","event":"NYC Restaurant Week","rid":6200,"sentiment":0.9876405482},{"RESTAURANTID":6200,"RESTAURANTNAME":"Gotham Bar and Grill","REVIEWTEXT":"We had made lunch reservations during Restaurant Week and are so pleased that we did! Overall the food was outstanding. The appetizers vibrant and fresh, the entrees were extremely well prepared and the dessert divine. The service was spot on! Cannot wait to return.","BVREVIEWID":72731494.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-17 13:30:00.0","event":"NYC Restaurant Week","rid":6200,"sentiment":0.9866343344},{"RESTAURANTID":1762,"RESTAURANTNAME":"Blue Smoke","REVIEWTEXT":"My sister and I tried Blue Smoke for restaurant week. Everything was great - food portions aren't huge but they are filling and delicious!!!! Our waitress was very attentive and nice! I would recommend for others to try and will be visiting the restaurant again for sure!  Thanks for a great experience!","BVREVIEWID":72852934.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-19 17:15:00.0","event":"NYC Restaurant Week","rid":1762,"sentiment":0.9952147473},{"RESTAURANTID":1762,"RESTAURANTNAME":"Blue Smoke","REVIEWTEXT":"Atmosphere, service, food, wine - all spectacular.   I expect a lot from Danny Meyer's places because they've delivered so beautifully every time.  Blue Smoke for lunch this week added to that reputation.  Friendly, welcoming hostess, lots of great choices on the Restaurant Week menu - Winter Kale Salad, Burnt Ends Sandwich and Apple Cake plus a side of the Brussels Sprouts, excellent wine (the Zin) and my afternoon was made heavenly.  Thank you to the team.  I'll be back.","BVREVIEWID":75138760.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-03-03 11:45:00.0","event":"NYC Restaurant Week","rid":1762,"sentiment":0.9776360134},{"RESTAURANTID":1762,"RESTAURANTNAME":"Blue Smoke","REVIEWTEXT":"For the past few days, I've been craving some really good BBQ food! My friend and I had been planning on taking advantage of restaurant week, and decided to go here. From the moment I stepped in, I loved the ambiance of the place. Our waiter was knowledgable about what was great here and was able to recommend some great beers that complimented our food choices. Everything came out in a timely fashion and the food was amazing! All in all, I can happily say that I was able to satisfy my craving. Definitely looking to go back again!","BVREVIEWID":75157595.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-25 19:00:00.0","event":"NYC Restaurant Week","rid":1762,"sentiment":0.9635693556},{"RESTAURANTID":52456,"RESTAURANTNAME":"Beauty and Essex","REVIEWTEXT":"Went here with a group of friends for my birthday. We ate off of the restaurant week menu which was delicious! It was a great spot for a girls night and perfect for a birthday dinner!","BVREVIEWID":74212451.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-27 18:00:00.0","event":"NYC Restaurant Week","rid":52456,"sentiment":0.9931401594},{"RESTAURANTID":52456,"RESTAURANTNAME":"Beauty and Essex","REVIEWTEXT":"loved there theme! Food was awesome - restaurant week picks on point ! Awesome cocktails! ;)","BVREVIEWID":75159206.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-03-03 18:30:00.0","event":"NYC Restaurant Week","rid":52456,"sentiment":0.991508538},{"RESTAURANTID":52456,"RESTAURANTNAME":"Beauty and Essex","REVIEWTEXT":"I dined here this past Wednesday evening and it happened to be during NYC's busy restaurant week so my expectations (especially from the menu) weren't too high.   But from the minute we walked in we absolutely loved it! The front is a pawn shop, so a speakeasy coolness that is totally unexpected.   As soon as you walk in you are greeted by the coolest and sweetest staff members.   The bar area on the first floor is def cramped since it's so close to check in and where they do the coat checks.   But the drinks are amazing... I personally really appreciated their Virgin drink offerings, the garnet gilet was amazing!  My gf had the emerald gimlet and was raving about the basil... Yummo! We dined upstairs past the Second bigger bar and had an amazing meal.   We had the tuna tacos,  eggplant Pizzette,  and the burgers... Amazing.  The service was top notch.   My only complaint is how noisy it got partially because they keep the music loud so ppl have to talk really loud =( in the end, cant","BVREVIEWID":74032897.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-25 18:00:00.0","event":"NYC Restaurant Week","rid":52456,"sentiment":0.9618056695},{"RESTAURANTID":49417,"RESTAURANTNAME":"Riverpark","REVIEWTEXT":"The Restaurant week menu was fantastic and all three courses were not only beautiful, but really delicious and modern.  The atmosphere is great and I would definitely love to go back.","BVREVIEWID":74948143.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-03-02 13:30:00.0","event":"NYC Restaurant Week","rid":49417,"sentiment":0.9960613902},{"RESTAURANTID":49417,"RESTAURANTNAME":"Riverpark","REVIEWTEXT":"Wonderful experience.  I treated 2 friends and they were impressed by the food and # of choices (it was restaurant week) per course.  The non alcohol lemonade a big hit.  The 1\/2 pour of wine excellent and generous.  Somewhat of an adventure just to find\/arrive but so worth it even on a freezing day.  Even the bread was outstanding.  Bravo to all.","BVREVIEWID":74127550.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-27 13:30:00.0","event":"NYC Restaurant Week","rid":49417,"sentiment":0.9814018678},{"RESTAURANTID":49417,"RESTAURANTNAME":"Riverpark","REVIEWTEXT":"I've come here for the 3rd time for restaurant week and I'm impressed every time. The menu is always changing with lots of very unique, well done options. Even though it's restaurant week, they definitely don't skimp on the portions either. It's a trek to get there, but if you have a car, there is also free parking which makes it very convenient. Will definitely keep coming back.","BVREVIEWID":75237049.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-03-05 21:00:00.0","event":"NYC Restaurant Week","rid":49417,"sentiment":0.9771046076},{"RESTAURANTID":4082,"RESTAURANTNAME":"L'Ecole- Restaurant of the International Culinary Center","REVIEWTEXT":"Went there on a Friday night for restaurant week, winter 2015.  Great options of dishes in the menu, delicious food from beginning to end and wine pairing option fantastic. HIghly recommended.","BVREVIEWID":74172105.0,"OVERALL":4,"DINED_DATE_LOCAL":"2015-02-27 18:45:00.0","event":"NYC Restaurant Week","rid":4082,"sentiment":0.9946506013},{"RESTAURANTID":4082,"RESTAURANTNAME":"L'Ecole- Restaurant of the International Culinary Center","REVIEWTEXT":"LOVED IT HERE! One of the only Restaurant Week menus that is exhaustive! Will definitely recommend to friends.","BVREVIEWID":72534865.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-17 12:00:00.0","event":"NYC Restaurant Week","rid":4082,"sentiment":0.9906286215},{"RESTAURANTID":4082,"RESTAURANTNAME":"L'Ecole- Restaurant of the International Culinary Center","REVIEWTEXT":"I came here during New York Restaurant Week and I want to go back every week. The food was phenomenal - as were the wine pairings. The service was really great. It was just a wonderful experience that really reminds you of what fine dining can be.","BVREVIEWID":75499999.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-03-04 13:15:00.0","event":"NYC Restaurant Week","rid":4082,"sentiment":0.96169543},{"RESTAURANTID":30514,"RESTAURANTNAME":"Atlantic Grill, Eastside","REVIEWTEXT":"I invited a colleague for lunch as my guest for restaurant week and the experience was outstanding.  As with so many of the other restaurants that are part of this affiliation, the food, staff and ambiance is all well done.  The presentation of the food was created in an artful manner, the food was delicious and our server, Michelle was charming, efficient and delightful.  She was gracious as well as accommodating in every way.    My colleague and I shared a unique experience and we were so appreciative to have been able to have this special moment.  Highly recommend.","BVREVIEWID":72495579.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-17 12:45:00.0","event":"NYC Restaurant Week","rid":30514,"sentiment":0.9837448277},{"RESTAURANTID":30514,"RESTAURANTNAME":"Atlantic Grill, Eastside","REVIEWTEXT":"This is my neighborhood \"go-to\" restaurant.  Delicious, well-prepared and nicely presented food in a pleasant atmosphere (especially if seated away from the line of tables against the south wall).  Professional service and restaurant week extra value made for a most delightful dinner.","BVREVIEWID":74129555.0,"OVERALL":4,"DINED_DATE_LOCAL":"2015-02-26 18:00:00.0","event":"NYC Restaurant Week","rid":30514,"sentiment":0.9834066972},{"RESTAURANTID":30514,"RESTAURANTNAME":"Atlantic Grill, Eastside","REVIEWTEXT":"we went to this restaurant for the winter restaurant week.  The menu had excellent choices. The quality of food was amazing . I would describe the whole experience as perfect!","BVREVIEWID":75503982.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-03-03 19:45:00.0","event":"NYC Restaurant Week","rid":30514,"sentiment":0.965833666},{"RESTAURANTID":29884,"RESTAURANTNAME":"The Capital Grille - NY ? Time Life Building","REVIEWTEXT":"I came here for restaurant week and the staff were amazing!  The food was delicious, especially their sam mash and lobster Mac & Cheese.  Great place for all.","BVREVIEWID":72453928.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-17 20:30:00.0","event":"NYC Restaurant Week","rid":29884,"sentiment":0.993699146},{"RESTAURANTID":29884,"RESTAURANTNAME":"The Capital Grille - NY ? Time Life Building","REVIEWTEXT":"Went here for restaurant week and the food was outstanding! Highly recommend! Will be back for the regular menu.","BVREVIEWID":72777387.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-20 20:00:00.0","event":"NYC Restaurant Week","rid":29884,"sentiment":0.9879859249},{"RESTAURANTID":29884,"RESTAURANTNAME":"The Capital Grille - NY ? Time Life Building","REVIEWTEXT":"This is one of our  favorite restaurants!The food is always first rate, the service impeccable and tha atmosphere sophisticated but never stuffy!  We were there for Restaurant week this time and tried a few new things.  Their clam chowder is really delicious and not too filling!  Steak of course is always top notch!  Sides too!  Just go and tryi it!","BVREVIEWID":75081489.0,"OVERALL":5,"DINED_DATE_LOCAL":"2015-02-27 18:00:00.0","event":"NYC Restaurant Week","rid":29884,"sentiment":0.9871287293}]